'''All types of messages and buttons'''
import emoji

LEXICON = {
    "greeting": "Привет, {}!\n"
                "Этот бот поможет получить возможность поучаствовать "
                "в дропах разных монет и даст бесплатный депозит.\n\n"
                "Все что тебе надо выполнть - несколько простых заданий:\n\n"
                "1️⃣ Подпишись на канал с самыми свежими новостями по крипте.\n"
                "2️⃣ Вступай в лучший сквад и двигайся к успеху вместе с нами (входим в ТОП 3).\n"
                "3️⃣ В виде бонуса, получи бесплатный депозит в казино.\n"
                "4️⃣ Приглашай друзей, так ты быстрее будешь расти\n\n"
                "P.S. За каждое выполненное задание и приглашенного друга ты "
                "получаешь баллы, которые формируют твой рейтинг.\n\n"
                "<b>Если уже готов, жми СТАРТ и полетели</b>"
                ":rocket::coin:\n",
    "no_tasks": "Привет, {}!\nНовых заданий покеа что нет.",
    "subscribe": "Давай начнем с подписки на канал, где будут публиковаться "
                 "самые актуальные новости по крипте, чтобы ты ниего не "
                 "пропустил.",
    "subscibe_2": "Ты забыл подписаться на канал.",
    "start_btn": "СТАРТ",
    "subscribe_btn": "Перейти в канал и подписаться",
    "next_btn": "Я уже подписался",
    "casino_url": "Рады, что ты присоединился к нам.\n"
                  "Лови бонусом бесплатный депозит в казино.\n"
                  "Входи в игру, а послу возвращайся за наградой и следующим "
                  "заданием",

    "enter_btn": "Войти в игру",
    "incorrect_message": "Для продолжения тебе необходимо отправить "
                         "сообщение от {} бота о присоединении, в этот чат, "
                         "чтобы получить еще одну топовую "
                         "игру.\nЕсли ты не заходил в игру, просто "
                         "нажми 'Войти в игру'",
    "pls_register": "Пожалуйста, перейдите по ссылке для продолжения",
    "play_game_btn": "Играть",
    "test": "Для входа в игру, нажми 'Войти в игру' "
            "и начинай играть.\n\n"
            "После не забудь отправить сообщение от <bold>Notcoin</bold>"
            " бота, чтобы получить еще одну"
            "топовую игру",
}
