'''All types of messages and buttons'''

LEXICON = {
    "greeting": "Привет, {}!\n"
                "Этот бот поможет получить возможность поучаствовать "
                "в дропах разных монет и даст бесплатный депозит.\n\n"
                "Все что тебе надо выполнть - несколько простых заданий:\n\n"
                "1️⃣ Подпишись на канал с самыми свежими новостями по крипте.\n"
                "2️⃣ Вступай в лучший сквад и двигайся к успеху вместе с нами (входим в ТОП 3).\n"
                "3️⃣ В виде бонуса, получи бесплатный депозит в казино.\n"
                "4️⃣ Приглашай друзей, так ты быстрее будешь расти\n\n"
                "P.S. За каждое выполненное задание и приглашенного друга ты "
                "получаешь баллы, которые формируют твой рейтинг.\n\n"
                "<b>Если уже готов, жми СТАРТ и полетели</b>"
                ":rocket::coin:\n",
    "no_tasks": "Привет, {}!\nНовых заданий пока что нет, но ты всегда можешь "
                "пригласить друзей и получить за это баллы, которые "
                "учитываюстся в твоем рейтинге и при розыгрышах.\n\n",
    "subscribe": "Давай начнем с подписки на канал, где будут публиковаться "
                 "самые актуальные новости по крипте, чтобы ты ниего не "
                 "пропустил.",
    "subscibe_2": "Ты забыл подписаться на канал.",
    "start_btn": "СТАРТ",
    "join_group_btn": "Перейти в канал и подписаться",
    "subscribe_btn": "Я подписался",
    "completed": "Поздравляем с выполнением задания №{} из 4🥳\n\nХочешь "
                 "зарабатывать на DeFi и раньше всех узнавать о быстрорастущих"
                 " монетах?📈",
    "squad": "Хочешь поучаствовать в возможном дропе Notcoin, вступай в лучший"
             " сквад и двигайся к успеху вместе с нами 🏅💰\n\n"
             "После возвращайся за остальными заданиями.",
    "join_btn": "Вступить в сквад",
    "next_btn": "Далее",
    "yes_btn": "Да",
    "play_game_btn": "Получить бесплатный депозит",
    "enter_btn": "Войти в игру",
    "casino": "Рады, что ты присоединился к нашему скваду.\n"
              "Лови бонусом бесплатный депозит в казино.\n"
              "Входи в игру, а после возвращайся за наградой и следующим "
              "заданием, удачи 🤞",
    "invite_btn": "Пригласить друга",
    "invite": "Приглашай друзей в бота и получай за каждого приглашенного "
              "друга баллы. Чем больше баллов, тем выше будет твой рейтинг "
              "и больше шансов при проведении дропов и розыгрышей.",
    "invite_link": "Чтобы пригласить друга отправь эту ссылку. "
                   "Можно ее отправить сразу нескольким людям\n\n",
    "invited": "Урааа!🥳\nТвой друг {} присоединился по "
               "ссылке-приглашению, за что ты получаешь 15 баллов.",
}
